# In this notebook you will find....

## 1) Wrangling df_cust

## 2) Perform consistency checks on df_cust

## 3) Merge df_cust with ords_prods_merge

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Create variable for the file path
path = r"D:\Data Immersion - Careerfoundry\Python Fundamentals for Data Analysts\Instacart Basket Analysis"

In [3]:
# Import dataframes (customer and orders_products_merged)
df_cust = pd.read_csv(os.path.join(path,'02 Data','Original Data','customers.csv'))

In [4]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))

In [5]:
# Check to see if dataframes imported properly
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
ords_prods_merge.head()

,Unnamed: 0_x,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0_y,order_id,user_id,order_number,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,median_prior_order,frequency_flag
0,0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,3139998,138,28,...,Mid Range product,Regular_busy,Regular Busy,Most orders,32,Regular Customer,6.935811,Low spender,8.0,Frequent Customer
1,0,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1977647,138,30,...,Mid Range product,Regular_busy,Regular Busy,Most orders,32,Regular Customer,6.935811,Low spender,8.0,Frequent Customer
2,0,1,Chocolate Sandwich Cookies,61,19,5.8,11433,389851,709,2,...,Mid Range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low spender,7.0,Frequent Customer
3,0,1,Chocolate Sandwich Cookies,61,19,5.8,12198,652770,764,1,...,Mid Range product,Regular_busy,Slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent Customer
4,0,1,Chocolate Sandwich Cookies,61,19,5.8,12200,1813452,764,3,...,Mid Range product,Least busy,Slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent Customer

In [7]:
ords_prods_merge.shape

(32404859, 26)

### Wrangling df_cust

In [8]:
# Perform exploratory analysis of df_cust
df_cust.shape

(206209, 10)

In [9]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [11]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

Personally, after analyzing the column names the fam_status columns seems to be the least useful column to me. But, considering the sales and marketing team wants to see the different demegraphics of their customers I am not going to drop the fam_status column or any other columns.

In [12]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [5]:
# Change column names 
df_cust.rename(columns = {'First Name':'first_name'}, inplace = True)
df_cust.rename(columns = {'Surnam': 'last_name'}, inplace = True)
df_cust.rename(columns = {'Gender':'gender'}, inplace = True)
df_cust.rename(columns = {'STATE':'state'}, inplace = True)
df_cust.rename(columns = {'Age':'age'}, inplace = True)
df_cust.rename(columns = {'n_dependants':'number_of_dependants'}, inplace = True)

In [6]:
# Check to the dataframe
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [15]:
df_cust.shape

(206209, 10)

### Perform consistency checks on df_cust

#### Mixed Data Types

In [6]:
# Check to see if there is any mixed data types in df_cust
for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) !=df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
        print(col)

first_name

In [6]:
# Fix  first_name column to be one data type (string)
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [7]:
# Check to see if change worked
for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) !=df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
        print(col)

In [19]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   first_name            206209 non-null  object
 2   last_name             206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_joined           206209 non-null  object
 7   number_of_dependants  206209 non-null  int64
 8   fam_status            206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

#### Missing Values

In [10]:
# Find missing values in dataframe
df_cust.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
fam_status              0
income                  0
dtype: int64

No missing values so need to fix anything

#### Duplicate values

In [11]:
# Find duplicate values
df_cust_dups = df_cust[df_cust.duplicated()]

In [22]:
df_cust_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, fam_status, income]
Index: []

No duplicate values so no need to change anything

### Merge df_cust with ords_prods_merge

In [23]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   first_name            206209 non-null  object
 2   last_name             206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_joined           206209 non-null  object
 7   number_of_dependants  206209 non-null  int64
 8   fam_status            206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [24]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 26 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Unnamed: 0_x            int64
 1   product_id              int64
 2   product_name            object
 3   aisle_id                int64
 4   department_id           int64
 5   prices                  float64
 6   Unnamed: 0_y            int64
 7   order_id                int64
 8   user_id                 int64
 9   order_number            int64
 10  orders_day_of_the_week  int64
 11  order_hour_of_day       int64
 12  days_since_prior_order  float64
 13  add_to_cart_order       int64
 14  reordered               int64
 15  _merge                  category
 16  price_range_loc         object
 17  busiest_day             object
 18  busiest_days            object
 19  busiest_period_of_day   object
 20  max_order               int64
 21  loyalty_flag            object
 22  avg_price               float64
 23  spending_flag           object
 24  median_prior_order      float64
 25  frequency_flag          object
dtypes: category(1), float64(4), int64(13), object(8)
memory usage: 6.3+ GB

In [ ]:
# Drop '_merge column'
ords_prods_merge.drop(columns = '_merge')

In [9]:
# Test merge without overwriting

test_merge = pd.merge(ords_prods_merge, df_cust, on = ['user_id'])

In [ ]:
# Check the success of the merge
test_merge.head()

In [ ]:
test_merge.info()

In [10]:
test_merge['_merge'].value_counts(dropna = False)

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [8]:
# Merge data with overwriting
ords_prods_cust_merge =  pd.merge(ords_prods_merge, df_cust, on = ['user_id'])

In [ ]:
ords_prods_cust_merge.head()324

#### Export data

In [ ]:
ords_prods_cust_merge.to_pickle(os.path.join(path,'02 Data','Prepared Data','orders_products_customers_merge.pkl'))